namespace ListReactiveProperty;

internal class TodoList
{
}

//todo : 動画の再生、一時停止、停止、進む、戻るを可能にする。
//todo : シークバーを作り、動画のシークを可能にする。
//todo : 0.5ページ移動を可能にする。
//todo : マウスでスクロールできるようにする。
//todo : 拡大縮小を可能にする。
//todo : 動画の時以外に再生ボタンを表示しない
//todo : ビュワーで動画が   表示されるようにする。
//todo : 回転のボタンの位置を調整
//todo : ウインドウ幅に合わせるボタンの実装
//todo : 全体を表示ボタンの実装
//todo : ページ指定ウインドウでエラーチェック
//todo : ファイル情報の表示
//todo : ファイルリストの保存
//todo : ファイルリストの読み込み
//todo : このアプリについての情報
//todo : ディスプレイの拡大縮小が100%以外の時に設定でセカンドモニターを選ぶと位置がおかしくなりWindowが表示されない。


//-----------------------------------------------------------------------------------------------
//append fieature
//todo : ランチャーを用意する
//todo : アップデート機能
//todo : 英語に対応する。
//todo : テキストファイルを読み込めるようにする。
//todo : 背景画像を設定できるようにする。
//todo : ウインドウが開かれている状態でウインドウを開く操作をしたときに前面に出るようにする。
//todo : ビューワウインドウの右クリックメニューに操作画面表示を追加

//-----------------------------------------------------------------------------------------------
//bug fix
//todo : DPIが高いときにpdfiumのレンダリングがおかしくなる






