namespace ViewerBy2nd;

internal class TodoList
{
}

//todo : 動画の停止、進む、戻るを可能にする。
//todo : 0.5ページ移動を可能にする。
//todo : マウスでスクロールできるようにする。
//todo : 拡大縮小を可能にする。
//todo : 動画の時以外に再生ボタンを表示しない
//todo : ビュワーで動画が   表示されるようにする。
//todo : 回転のボタンの位置を調整
//todo : ウインドウ幅に合わせるボタンの実装
//todo : 全体を表示ボタンの実装
//todo : ページ指定ウインドウでエラーチェック
//todo : ファイル情報の表示
//todo : ファイルリストの保存
//todo : ファイルリストの読み込み
//todo : このアプリについての情報


//todo : バージョン番号
//todo : ビュワーが開いていないときにはサムネイル動画のみが再生されるがビュワーが開いているときにはビュワーが再生。サムネイルは位置合わせ。


//-----------------------------------------------------------------------------------------------
//append fieature
//todo : ランチャーを用意する
//todo : アップデート機能
//todo : 英語に対応する。
//todo : テキストファイルを読み込めるようにする。
//todo : 背景画像を設定できるようにする。
//todo : デフォルト画像を用意"動画や画像はここに表示されます"
//todo : ビューワーウインドウの位置を保存する
//todo : 音量の設定ができるようにする
//todo : モニターが２つ以上ある環境でデフォルト出力先をセカンドディスプレイとしておく
//todo : デフォルトでビュワーを表示しておく
//-----------------------------------------------------------------------------------------------
//bug fix
//todo : DPIが高いときにpdfiumのレンダリングがおかしくなる






